# f(x)=6x(1-x), 0<x<1
# g(x)=1, 0<x<1
#f(x)/g(x)<=3/2  c=3/2  f(x)/(cg(x))=4x(1-x)

#用[0,1]上均匀分布的随机数产生其他分布的随机变量值（筛选法）
u1<-runif(10000,0,1) #产生均匀分布随机数1
u2<-runif(10000,0,1) #产生均匀分布随机数2
X={}

for(i in 1:10000){
  if(u1[i]<(4*u2[i]-4*u2[i]^2)){
    X[length(X)+1]=u2[i]
  }
}

f=6*X-6*X^2
F=3*X^2-2*X^3

plot(X,f,type="h") #查看概率密度图

plot(X,F,type="h") #查看概率分布图

mean(X) #均值近似0.5（随机变量期望值）

#---------------------------------------------#

#逆变换法产生离散随机变量值
prob1<-c(0.1,0.2,0.2,0.2,0.3)
x<-c(0,1,2,3,4)
x<-sample(x,size=1000,replace=TRUE,prob1)

#计算样本累积频率值
p<-numeric(5)
for(i in 1:1000){
  for(j in 1:5){
    if(x[i]<=j-1) p[j]=p[j]+1/1000
  }
}

#比较经验分布与理论分布
prob2<-c(0.1,0.3,0.5,0.7,1)
plot(0:4,p,type="s",col="red")
lines(0:4,prob2,type="s",col="blue")






